SMB/src/Catalogs/СМП_УчетныеЗаписиБанков/СМП_УчетныеЗаписиБанков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СМП_УчетныеЗаписиБанков</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Банк</name>
    <type>
      <types>EnumRef.СМП_ПоддерживаемыеИнтеграцииСБанками</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодключаемаяОбработка</name>
    <type>
      <types>CatalogRef.ДополнительныеОтчетыИОбработки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Токен</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДоступаДляНовыхКонтрагентов</name>
    <type>
      <types>CatalogRef.ГруппыДоступаКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздатьНовогоКонтрагентаПриЗагрузкеВыписки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьРегламентныеЗадания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторРегламентногоЗадания</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДляWebHook</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

SMB/src/Catalogs/СМП_УчетныеЗаписиБанков/ManagerModule.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Запускает процес загрузки банковской выписки через API банка.
//
// Параметры:
//   ФормаЗагрузкиКлиентБанка - ФормаКлиентскогоПриложения - обработка КлиентБанк: ФормаЗагрузка.
//   УчетнаяЗаписьБанка - СправочникСсылка.СМП_УчетныеЗаписиБанков - учетная запись для которой выполняется загрузка данных.
//   ТаблицаТаблицДокументов - ТаблицаЗначений - таблица найденных документов.
//   ТаблицаКонтрагентов - ДеревоЗначений - список контрагентов.
//
Процедура ЗагрузитьВыпискуЧерезAPI(ФормаЗагрузкиКлиентБанка, УчетнаяЗаписьБанка, ТаблицаТаблицДокументов, ТаблицаКонтрагентов) Экспорт
	
	ДанныеУчетнойЗаписи = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(УчетнаяЗаписьБанка, "Банк, ИД, Токен, Логин, Пароль", Истина);
	
	Если СМП_РаботаСБанкамиСервер.ФункционалБанкаПодключен(ДанныеУчетнойЗаписи.Банк, "ПриватБанк") Тогда
		
		МодульИнтеграцииСБанкомПриватБанк = ОбщегоНазначения.ОбщийМодуль("СМП_РаботаСБанкамиПриватБанкAPIСервер");
		МодульИнтеграцииСБанкомПриватБанк.Прочитать(
		ФормаЗагрузкиКлиентБанка, ДанныеУчетнойЗаписи.ИД, ДанныеУчетнойЗаписи.Токен, ТаблицаТаблицДокументов, ТаблицаКонтрагентов);
		
	ИначеЕсли СМП_РаботаСБанкамиСервер.ФункционалБанкаПодключен(ДанныеУчетнойЗаписи.Банк, "МОНОБанк") Тогда
		
		МодульИнтеграцииСБанкомМонобанк = ОбщегоНазначения.ОбщийМодуль("СМП_РаботаСБанкамиМонобанкAPIСервер");
		МодульИнтеграцииСБанкомМонобанк.ЗагрузитьДанныеПоВыписке(
		ФормаЗагрузкиКлиентБанка, УчетнаяЗаписьБанка, ДанныеУчетнойЗаписи.Токен, ТаблицаТаблицДокументов, ТаблицаКонтрагентов);
		
	ИначеЕсли СМП_РаботаСБанкамиСервер.ФункционалБанкаПодключен(ДанныеУчетнойЗаписи.Банк, "ПУМБ") Тогда
		
		МодульИнтеграцииСБанкомПУМБ = ОбщегоНазначения.ОбщийМодуль("СМП_РаботаСБанкамиПУМБAPIСервер");
		МодульИнтеграцииСБанкомПУМБ.Прочитать(
		ФормаЗагрузкиКлиентБанка, УчетнаяЗаписьБанка, ДанныеУчетнойЗаписи, ТаблицаТаблицДокументов, ТаблицаКонтрагентов);
		
	КонецЕсли;
		
КонецПроцедуры // ЗагрузитьВыпискуЧерезAPI

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов

// Функция возвращает список имен «ключевых» реквизитов.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("Организация");
	Результат.Добавить("БанковскийСчет");
	Результат.Добавить("Банк");
	Результат.Добавить("ПодключаемаяОбработка");
	Результат.Добавить("ИД");
	Результат.Добавить("Токен");
	Результат.Добавить("ИспользоватьРегламентныеЗадания");
	Результат.Добавить("АдресДляWebHook");
	
	Возврат Результат;
	
КонецФункции // ПолучитьБлокируемыеРеквизитыОбъекта()

// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов

#КонецОбласти
